Config/Catalogs/ОперацииУчетаВещевогоДовольствия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОперацииУчетаВещевогоДовольствия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВещевогоДовольствия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормированияОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияОперацийУчетаВещевогоДовольствия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УстанавливатьЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УстанавливатьЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставПоследовательностиОпераций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОперацияУчетаВещевогоДовольствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОперацииУчетаВещевогоДовольствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/СпособыФормированияОперацийУчетаВещевогоДовольствия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыФормированияОперацийУчетаВещевогоДовольствия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОднаОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследовательностьОпераций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНеПереносится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходитВПоследовательность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/РеквизитыТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РеквизитыТиповыхОпераций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТиповыеОперации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоставляемыйРеквизитТиповойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставляемыеРеквизитыТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитПроводки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяДляФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЭлементов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПоддержкиТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеОпции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФункциональнойОпции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ОперацииУчетаВещевогоДовольствия/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Предопределенные настройки по виду операции.
// 
// Параметры:
//  ВидОперации - ПеречислениеСсылка.ВидыОперацийВещевогоДовольствия
// 
// Возвращаемое значение:
//  Неопределено, Массив из см. ОписаниеЭлемента - Предопределенные настройки по виду операции
Функция ПредопределенныеНастройкиПоВидуОперации(ВидОперации) Экспорт
	ВсеНастройки = ПрочитатьПредопределенныеДанные();
	ПодходящиеНастройки = ВсеНастройки.Получить(ВидОперации);
	Возврат ПодходящиеНастройки;
КонецФункции

// Допустимые виды документа по виду операции.
// 
// Параметры:
//  ВидОперации - ПеречислениеСсылка.ВидыОперацийВещевогоДовольствия
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ИдентификаторыОбъектовМетаданных - Допустимые виды документа по виду операции
Функция ДопустимыеВидыДокументаПоВидуОперации(ВидОперации = Неопределено) Экспорт

	РазрешенныеВидыДокументов = Новый СписокЗначений;
	Для Каждого ТипОбъекта Из Метаданные.ОпределяемыеТипы.ДокументыЗагружаемыеИзВД.Тип.Типы() Цикл
		РазрешенныеВидыДокументов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта));
	КонецЦикла;
	
	РазрешенныеВидыДокументов.СортироватьПоПредставлению();
	
	Возврат РазрешенныеВидыДокументов.ВыгрузитьЗначения();

КонецФункции // ДопустимыеВидыДокументаПоВидуОперации()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Используется только в старых алгоритмах загрузки данных.
// Заполнить реквизиты операции после загрузки объекта. Используется в алгоритмах загрузки из Вещевого довольствия.
// 
// Параметры:
//  Объект - ДокументОбъект
//  ПараметрыОбъекта - Структура
//  ВариантУчета - Структура
Процедура ЗаполнитьРеквизитыОперацииПослеЗагрузкиОбъекта(Объект, ПараметрыОбъекта, ВариантУчета = Неопределено) Экспорт

	Если ВариантУчета = Неопределено Тогда
		ВариантУчета = ПараметрыОбъекта.Получить("ВариантУчета");
	КонецЕсли;
	
	Если ВариантУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТиповаяОперация = ВариантУчета.ТиповаяОперация;;
	
	Если НЕ ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат;
	КонецЕсли;
		
	ДополнительныеРеквизиты = Новый Структура;
		
	Для каждого ЗначениеДопРеквизита Из ВариантУчета.РеквизитыОперации Цикл
	
		Если ЗначениеДопРеквизита.УстанавливатьЗначение Тогда
			
			ДополнительныеРеквизиты.Вставить(ЗначениеДопРеквизита.ИмяРеквизита, ЗначениеДопРеквизита.ЗначениеРеквизита);
			
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого ДополнительныйПараметр Из ВариантУчета.ПараметрыОбмена Цикл
		
		ЧастиИмениПараметра = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ВРЕГ(ДополнительныйПараметр.ЗначениеПараметра));
		Если ЧастиИмениПараметра.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧастиИмениПараметра[0] = "ДОПОЛНИТЕЛЬНЫЙРЕКВИЗИТ" Тогда
			
			ДополнительныеРеквизиты.Вставить(ЧастиИмениПараметра[1], ПараметрыОбъекта.Получить(ДополнительныйПараметр.ИмяПараметра));
			
		КонецЕсли;
	
	КонецЦикла;
		
	БухгалтерскиеОперацииСервер.ЗаписатьДанныеТиповойОперацииОбъекта(Объект, ТиповаяОперация, ДополнительныеРеквизиты);
		
КонецПроцедуры

// Устарела. Используется только в старых алгоритмах загрузки данных.
// Заполнить реквизиты объекта после загрузки объекта. Используется в алгоритмах загрузки из Вещевого довольствия.
// 
// Параметры:
//  Объект - ДокументОбъект
//  ПараметрыОбъекта - Структура
//  ВариантУчета - Структура
Процедура ЗаполнитьРеквизитыОбъектаПослеЗагрузкиОбъекта(Объект, ПараметрыОбъекта, ВариантУчета = Неопределено) Экспорт

	Если ВариантУчета = Неопределено Тогда
		ВариантУчета = ПараметрыОбъекта.Получить("ВариантУчета");
	КонецЕсли;
	
	Если ВариантУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого НастройкаДокумента Из ВариантУчета.РеквизитыДокумента Цикл
	
		Если НастройкаДокумента.УстанавливатьЗначение Тогда
		
			Объект[НастройкаДокумента.ИмяРеквизита] = НастройкаДокумента.ЗначениеРеквизита;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого ДополнительныйПараметр Из ВариантУчета.ПараметрыОбмена Цикл
		
		ЧастиИмениПараметра = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ВРЕГ(ДополнительныйПараметр.ЗначениеПараметра));
		Если ЧастиИмениПараметра.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧастиИмениПараметра[0] = "ДОКУМЕНТ" Тогда
			
			Объект[ЧастиИмениПараметра[1]] = ПараметрыОбъекта.Получить(ДополнительныйПараметр.ИмяПараметра);
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьФабрикуXDTOИзМакета()
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xsd");
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	Текст = ПолучитьМакет("СхемаДанных").ПолучитьТекст();
	ТекстовыйДокумент.УстановитьТекст(Текст);
	ТекстовыйДокумент.Записать(ИмяВременногоФайла, КодировкаТекста.UTF8);
	
	Фабрика = СоздатьФабрикуXDTO(ИмяВременногоФайла);
	
	//@skip-check empty-except-statement
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// Обработка исключения не требуется
	КонецПопытки;
	
	Возврат Фабрика;
КонецФункции

Функция ВыгрузитьДанныеСправочника(Организация) Экспорт
	
	Фабрика = СоздатьФабрикуXDTOИзМакета();
	
	//ВсеОперации = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("Operation_VD_1_1", "СписокОпераций"));
	ВсеОперации = Фабрика.Создать(Фабрика.Тип("Operation_VD_1_1", "СписокОпераций"));
	Выборка = ВыборкаСправочника(Организация);
	Пока Выборка.Следующий() Цикл
		ВыгрузитьЭлементВXDTO(Фабрика, Выборка, ВсеОперации);
	КонецЦикла;
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	Фабрика.ЗаписатьXML(Запись, ВсеОперации);
	
	Возврат Запись.Закрыть();

КонецФункции

Функция ВыборкаСправочника(Организация)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииУчетаВещевогоДовольствия.Ссылка КАК Ссылка,
	|	ОперацииУчетаВещевогоДовольствия.ВерсияДанных КАК ВерсияДанных,
	|	ОперацииУчетаВещевогоДовольствия.ПометкаУдаления КАК ПометкаУдаления,
	|	ОперацииУчетаВещевогоДовольствия.Код КАК Код,
	|	ОперацииУчетаВещевогоДовольствия.Наименование КАК Наименование,
	|	ОперацииУчетаВещевогоДовольствия.ВидОперации КАК ВидОперации,
	|	ОперацииУчетаВещевогоДовольствия.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ОперацииУчетаВещевогоДовольствия.Организация КАК Организация,
	|	ОперацииУчетаВещевогоДовольствия.СпособФормированияОперации КАК СпособФормированияОперации,
	|	ОперацииУчетаВещевогоДовольствия.РеквизитыДокумента.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		УстанавливатьЗначение КАК УстанавливатьЗначение,
	|		ИмяРеквизита КАК ИмяРеквизита,
	|		ЗначениеРеквизита КАК ЗначениеРеквизита
	|	) КАК РеквизитыДокумента,
	|	ОперацииУчетаВещевогоДовольствия.РеквизитыОперации.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		УстанавливатьЗначение КАК УстанавливатьЗначение,
	|		ИмяРеквизита КАК ИмяРеквизита,
	|		ЗначениеРеквизита КАК ЗначениеРеквизита
	|	) КАК РеквизитыОперации,
	|	ОперацииУчетаВещевогоДовольствия.ПараметрыОбмена.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИмяПараметра КАК ИмяПараметра,
	|		ЗначениеПараметра КАК ЗначениеПараметра
	|	) КАК ПараметрыОбмена,
	|	ОперацииУчетаВещевогоДовольствия.СоставПоследовательностиОпераций.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ОперацияУчетаВещевогоДовольствия КАК ОперацияУчетаВещевогоДовольствия
	|	) КАК СоставПоследовательностиОпераций,
	|	ОперацииУчетаВещевогоДовольствия.Предопределенный КАК Предопределенный,
	|	ОперацииУчетаВещевогоДовольствия.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ЕСТЬNULL(ОперацииУчетаВещевогоДовольствия.ИдентификаторДокумента.Имя, """") КАК ВидДокумента,
	|	ЕСТЬNULL(ОперацииУчетаВещевогоДовольствия.ТиповаяОперация.ИмяПредопределенныхДанных, """") КАК ТиповаяОперация
	|ИЗ
	|	Справочник.ОперацииУчетаВещевогоДовольствия КАК ОперацииУчетаВещевогоДовольствия
	|ГДЕ
	|	ОперацииУчетаВещевогоДовольствия.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидОперации";
	Запрос.УстановитьПараметр("Организация", Организация);
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Процедура ВыгрузитьЭлементВXDTO(Фабрика, Выборка, ВсеОперации)

	Элемент = Фабрика.Создать(Фабрика.Тип("Operation_VD_1_1", "НастройкаОперации"));
	Элемент.АльтернативныйВариант = Ложь;
	Элемент.ВидОперации = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.ВидОперации);
	Элемент.СпособФормированияОперации = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.СпособФормированияОперации);
	Элемент.ВидДокумента = Выборка.ВидДокумента;
	Элемент.ТиповаяОперация = Выборка.ТиповаяОперация;
	
	ДобавитьТабличнуюЧастьВXDTO(Фабрика, Выборка.РеквизитыДокумента.Выбрать(), Элемент, "РеквизитыДокумента");
	ДобавитьТабличнуюЧастьВXDTO(Фабрика, Выборка.РеквизитыОперации.Выбрать(), Элемент, "РеквизитыОперации");
	ДобавитьТабличнуюЧастьВXDTO(Фабрика, Выборка.ПараметрыОбмена.Выбрать(), Элемент, "ПараметрыОбмена");
	
	ВсеОперации.Операция.Добавить(Элемент);

КонецПроцедуры

Процедура ДобавитьТабличнуюЧастьВXDTO(Фабрика, Выборка, ОбъектXDTO, ИмяТаблицы)
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаXDTO = Фабрика.Создать(Фабрика.Тип("Operation_VD_1_1", ИмяТаблицы));
	Пока Выборка.Следующий() Цикл
		СтрокаXDTO = Фабрика.Создать(Фабрика.Тип("Operation_VD_1_1", ИмяТаблицы+ ".Строка"));
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "ЗначениеРеквизита")
				И ЗначениеЗаполнено(Выборка.ЗначениеРеквизита) Тогда
			Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(Выборка.ЗначениеРеквизита)) Тогда
				СтрокаXDTO.ЗначениеРеквизита = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.ЗначениеРеквизита);
			Иначе
				СтрокаXDTO.ЗначениеРеквизита = Строка(Выборка.ЗначениеРеквизита);
			КонецЕсли;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "ИмяРеквизита") Тогда
			СтрокаXDTO.ИмяРеквизита = Выборка.ИмяРеквизита;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "УстанавливатьЗначение") Тогда
			СтрокаXDTO.УстанавливатьЗначение = Выборка.УстанавливатьЗначение;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "ЗначениеПараметра") Тогда
			СтрокаXDTO.ЗначениеПараметра = Выборка.ЗначениеПараметра;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "ИмяПараметра") Тогда
			СтрокаXDTO.ИмяПараметра = Выборка.ИмяПараметра;
		КонецЕсли;
		ТаблицаXDTO.Строка.Добавить(СтрокаXDTO);
	КонецЦикла;
	ОбъектXDTO.Установить(ИмяТаблицы, ТаблицаXDTO);
	
КонецПроцедуры

// Описание элемента.
// 
// Возвращаемое значение:
//  Структура - Описание элемента:
// * АльтернативныйВариант - Булево - 
// * ВидОперации - ПеречислениеСсылка.ВидыОперацийВещевогоДовольствия - 
// * СпособФормированияОперации - ПеречислениеСсылка.СпособыФормированияОперацийУчетаВещевогоДовольствия - 
// * ИдентификаторДокумента - СправочникСсылка.ИдентификаторыОбъектовМетаданных - 
// * ТиповаяОперация - СправочникСсылка.ТиповыеОперации - 
// * РеквизитыДокумента - ТаблицаЗначений - :
// ** ЗначениеРеквизита - Произвольный 
// ** ИмяРеквизита - Строка - 
// ** УстанавливатьЗначение - Булево - 
// * РеквизитыОперации - ТаблицаЗначений - :
// ** ЗначениеРеквизита - Произвольный 
// ** ИмяРеквизита - Строка - 
// ** УстанавливатьЗначение - Булево - 
// * ПараметрыОбмена - ТаблицаЗначений - :
// ** ЗначениеПараметра - Строка - 
// ** ИмяПараметра - Строка - 
Функция ОписаниеЭлемента()

	Результат = Новый Структура;
	Результат.Вставить("АльтернативныйВариант", Ложь);
	Результат.Вставить("ВидОперации", Перечисления.ВидыОперацийВещевогоДовольствия.ПустаяСсылка());
	Результат.Вставить("СпособФормированияОперации", Перечисления.СпособыФормированияОперацийУчетаВещевогоДовольствия.ПустаяСсылка());
	Результат.Вставить("ИдентификаторДокумента", Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка());
	Результат.Вставить("ТиповаяОперация", Справочники.ТиповыеОперации.ПустаяСсылка());
	РеквизитыДокумента = Новый ТаблицаЗначений;
	РеквизитыДокумента.Колонки.Добавить("ЗначениеРеквизита");
	РеквизитыДокумента.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	РеквизитыДокумента.Колонки.Добавить("УстанавливатьЗначение", Новый ОписаниеТипов("Булево"));
	Результат.Вставить("РеквизитыДокумента", РеквизитыДокумента);
	РеквизитыОперации = Новый ТаблицаЗначений;
	РеквизитыОперации.Колонки.Добавить("ЗначениеРеквизита");
	РеквизитыОперации.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	РеквизитыОперации.Колонки.Добавить("УстанавливатьЗначение", Новый ОписаниеТипов("Булево"));
	Результат.Вставить("РеквизитыОперации", РеквизитыОперации);
	ПараметрыОбмена = Новый ТаблицаЗначений;
	ПараметрыОбмена.Колонки.Добавить("ЗначениеПараметра", Новый ОписаниеТипов("Строка"));
	ПараметрыОбмена.Колонки.Добавить("ИмяПараметра", Новый ОписаниеТипов("Строка"));
	Результат.Вставить("ПараметрыОбмена", ПараметрыОбмена);
	Возврат Результат;

КонецФункции

Функция ПолучитьЗагружаемыйЭлемент(ОперацияXDTO)
	
	НовыйЭлемент = ОписаниеЭлемента();
	ВсеСвойства = ОперацияXDTO.Свойства();
	Если ВсеСвойства.Получить("АльтернативныйВариант") <> Неопределено Тогда
		ТипБулево = Новый ОписаниеТипов("Булево");
		НовыйЭлемент.АльтернативныйВариант = ТипБулево.ПривестиЗначение(ОперацияXDTO.АльтернативныйВариант);
	КонецЕсли;
	Если ВсеСвойства.Получить("ВидОперации") <> Неопределено Тогда
		НовыйЭлемент.ВидОперации = ОбщегоНазначения.ПредопределенныйЭлемент(
			"Перечисление.ВидыОперацийВещевогоДовольствия." + ОперацияXDTO.ВидОперации);
	КонецЕсли;
	Если ВсеСвойства.Получить("СпособФормированияОперации") <> Неопределено Тогда
		НовыйЭлемент.СпособФормированияОперации = ОбщегоНазначения.ПредопределенныйЭлемент(
			"Перечисление.СпособыФормированияОперацийУчетаВещевогоДовольствия." + ОперацияXDTO.СпособФормированияОперации);
	КонецЕсли;
	Если НовыйЭлемент.СпособФормированияОперации = Перечисления.СпособыФормированияОперацийУчетаВещевогоДовольствия.ОперацияНеПереносится Тогда
		Возврат НовыйЭлемент;
	КонецЕсли;
	
	Если ВсеСвойства.Получить("ВидДокумента") <> Неопределено Тогда
		НовыйЭлемент.ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			"Документ." + ОперацияXDTO.ВидДокумента);
	КонецЕсли;
	Если ВсеСвойства.Получить("ТиповаяОперация") <> Неопределено Тогда
		НовыйЭлемент.ТиповаяОперация = ОбщегоНазначения.ПредопределенныйЭлемент(
			"Справочник.ТиповыеОперации." + ОперацияXDTO.ТиповаяОперация);
	КонецЕсли;
	Если ВсеСвойства.Получить("РеквизитыДокумента") <> Неопределено Тогда
		ПолучитьТабличнуюЧасть(НовыйЭлемент, ОперацияXDTO, "РеквизитыДокумента", "РеквизитДокумента");
	КонецЕсли;
	Если ВсеСвойства.Получить("РеквизитыОперации") <> Неопределено Тогда
		ПолучитьТабличнуюЧасть(НовыйЭлемент, ОперацияXDTO, "РеквизитыОперации", "РеквизитОперации");
	КонецЕсли;
	Если ВсеСвойства.Получить("ПараметрыОбмена") <> Неопределено Тогда
		ПолучитьТабличнуюЧасть(НовыйЭлемент, ОперацияXDTO, "ПараметрыОбмена");
	КонецЕсли;
	
	Возврат НовыйЭлемент;
КонецФункции

Процедура ПолучитьТабличнуюЧасть(НовыйЭлемент, ОперацияXDTO, ИмяТабличнойЧасти, СпособОпределенияРеквизитов = "")
	Таблица = ОперацияXDTO[ИмяТабличнойЧасти].Строка;
	Если ТипЗнч(Таблица) = Тип("ОбъектXDTO") Тогда
		ДобавитьСтрокуТабличнойЧасти(НовыйЭлемент, Таблица, ИмяТабличнойЧасти, СпособОпределенияРеквизитов);
	ИначеЕсли ТипЗнч(Таблица) = Тип("СписокXDTO") Тогда
		Для Каждого СтрокаСписка Из Таблица Цикл
			ДобавитьСтрокуТабличнойЧасти(НовыйЭлемент, СтрокаСписка, ИмяТабличнойЧасти, СпособОпределенияРеквизитов);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьСтрокуТабличнойЧасти(НовыйЭлемент, ОбъектXDTO, ИмяТабличнойЧасти, СпособОпределенияРеквизитов)
	
	НоваяСтрока = НовыйЭлемент[ИмяТабличнойЧасти].Добавить();
	Для Каждого СвойствоОбъекта Из ОбъектXDTO.Свойства() Цикл
		ЗначениеСвойства = ОбъектXDTO.Получить(СвойствоОбъекта.Имя);
		Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Или Не ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			Продолжить;
		КонецЕсли;
		Если СвойствоОбъекта.Имя = "ЗначениеРеквизита" Тогда
			ИмяРеквизита = ОбъектXDTO.Получить("ИмяРеквизита");
			Если СпособОпределенияРеквизитов = "РеквизитДокумента" Тогда
				ЗначениеСвойства = ЗначениеРеквизитаИзСтроки(
					ТипРеквизитаДокумента(НовыйЭлемент.ИдентификаторДокумента, ИмяРеквизита),
					ЗначениеСвойства)
			ИначеЕсли СпособОпределенияРеквизитов = "РеквизитОперации" Тогда
				ЗначениеСвойства = ЗначениеРеквизитаИзСтроки(
					ТипРеквизитаОперации(НовыйЭлемент.ТиповаяОперация, ИмяРеквизита),
					ЗначениеСвойства)
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока[СвойствоОбъекта.Имя] = ЗначениеСвойства;
	КонецЦикла;
	
КонецПроцедуры

Функция ТипРеквизитаДокумента(ИдентификаторДокумента, ИмяРеквизита)
	Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитДокумента = МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита);
	Если РеквизитДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РеквизитДокумента.Тип.Типы()[0];
КонецФункции

Функция ТипРеквизитаОперации(ТиповаяОперация, ИмяДляФормулы)
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения КАК РеквизитПроводкиТипЗначения
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы = &ИмяДляФормулы
	|	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления
	|	И РеквизитыТиповыхОпераций.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", ТиповаяОперация);
	Запрос.УстановитьПараметр("ИмяДляФормулы", ИмяДляФормулы);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РеквизитПроводкиТипЗначения;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ЗначениеРеквизитаИзСтроки(ТипРеквизита, ТекстовоеЗначение)

	Если ТипРеквизита = Неопределено Тогда
		Возврат ТекстовоеЗначение;
	КонецЕсли;

	МетаданныеПоТипу = Метаданные.НайтиПоТипу(ТипРеквизита);
	Если МетаданныеПоТипу = Неопределено Тогда
		Возврат ОбщегоНазначенияБГУ.ПолучитьЗначениеРеквизитаИзСтроки(Строка(ТипРеквизита), ТекстовоеЗначение);
	Иначе
		Возврат ОбщегоНазначенияБГУ.ПолучитьЗначениеРеквизитаИзСтроки(МетаданныеПоТипу.ПолноеИмя(), ТекстовоеЗначение);
	КонецЕсли;
КонецФункции

Функция ПрочитатьПредопределенныеДанные()
	
	Фабрика = СоздатьФабрикуXDTOИзМакета();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ПолучитьМакет("ПоставляемыеЭлементы").ПолучитьТекст());
	СписокЭлементовXDTO = Фабрика.ПрочитатьXML(Чтение);
	
	Результат = Новый Соответствие;
	
	Для Каждого ОперацияXDTO Из СписокЭлементовXDTO.Операция Цикл
		ЗагружаемыйЭлемент = ПолучитьЗагружаемыйЭлемент(ОперацияXDTO);
		ДобавитьЭлементВСписокПредопределенных(Результат, ЗагружаемыйЭлемент);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ДобавитьЭлементВСписокПредопределенных(СписокПредопределенных, НовыйЭлемент)
	СписокЭлементов = СписокПредопределенных.Получить(НовыйЭлемент.ВидОперации);
	Если СписокЭлементов = Неопределено Тогда
		СписокЭлементов = Новый Массив;
		СписокПредопределенных.Вставить(НовыйЭлемент.ВидОперации, СписокЭлементов);
	КонецЕсли;
	СписокЭлементов.Добавить(НовыйЭлемент);
	Если СписокЭлементов.Количество() > 1 Тогда
		Индекс = СписокЭлементов.Количество() - 1;
		Пока Индекс > 0
				И Не СписокЭлементов[Индекс].АльтернативныйВариант
				И СписокЭлементов[Индекс - 1].АльтернативныйВариант Цикл
			Поменять(СписокЭлементов, Индекс, Индекс - 1);
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура Поменять(Список, Индекс1, Индекс2)
	Временная = Список[Индекс1];
	Список[Индекс1] = Список[Индекс2];
	Список[Индекс2] = Временная;
КонецПроцедуры

Функция ПолучитьЗаписанныйЭлементИлиСоздатьНовый(Организация, ВидОперации)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОперацииУчетаВещевогоДовольствия.Ссылка
	|ИЗ
	|	Справочник.ОперацииУчетаВещевогоДовольствия КАК ОперацииУчетаВещевогоДовольствия
	|ГДЕ
	|	ОперацииУчетаВещевогоДовольствия.Организация = &Организация
	|	И ОперацииУчетаВещевогоДовольствия.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ТекущийЭлемент = Выборка.Ссылка.ПолучитьОбъект(); // СправочникОбъект.ОперацииУчетаВещевогоДовольствия
		ТекущийЭлемент.ДополнительныеСвойства.Вставить("ВерсионированиеОбъектовКомментарийКВерсии",
			НСтр("ru = 'Загрузка значений по умолчанию'"));
		Если ТекущийЭлемент.ПометкаУдаления Тогда
			ТекущийЭлемент.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		
		Для каждого ТекСтрока Из ТекущийЭлемент.РеквизитыДокумента Цикл
			ТекСтрока.УстанавливатьЗначение = Ложь;
		КонецЦикла; 
		Для каждого ТекСтрока Из ТекущийЭлемент.РеквизитыОперации Цикл
			ТекСтрока.УстанавливатьЗначение = Ложь;
		КонецЦикла; 
		ТекущийЭлемент.ПараметрыОбмена.Очистить();
		
	Иначе
		
		ТекущийЭлемент = СоздатьЭлемент();
		ТекущийЭлемент.ВидОперации = ВидОперации;
		ТекущийЭлемент.Организация = Организация;
		
	КонецЕсли;
	
	Возврат ТекущийЭлемент;

КонецФункции // ПолучитьЗаписанныйЭлементИлиСоздатьНовый()

Процедура ЗаполнитьОперациюИзСвойствОперации(Объект, Операция) Экспорт
	Для Каждого Свойство Из Операция Цикл
		Если ТипЗнч(Свойство.Значение) = Тип("ТаблицаЗначений") Тогда
			ЗаполнитьТаблицуИзСвойствОперации(Объект[Свойство.Ключ], Свойство.Значение);
		ИначеЕсли Свойство.Ключ <> "АльтернативныйВариант" Тогда
			Объект[Свойство.Ключ] = Свойство.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьТаблицуИзСвойствОперации(ТаблицаОбъекта, Таблица)
	
	ВременнаяТаблица = ТаблицаОбъекта.Выгрузить(); // ТаблицаЗначений
	ТаблицаОбъекта.Загрузить(Таблица);
	ПроверятьЗаполнениеЗначения = (ВременнаяТаблица.Колонки.Найти("ИмяРеквизита") <> Неопределено);
	Если Не ПроверятьЗаполнениеЗначения Тогда
		Возврат;
	КонецЕсли;
	ВременнаяТаблица.Индексы.Добавить("ИмяРеквизита");
	Отбор = Новый Структура("ИмяРеквизита");
	Для Каждого СтрокаТаблицы Из ТаблицаОбъекта Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЗначениеРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		Отбор.ИмяРеквизита = СтрокаТаблицы.ИмяРеквизита;
		НайденныеСтроки = ВременнаяТаблица.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СуществующаяСтрока = НайденныеСтроки[0];
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ЗначениеРеквизита)
					И СуществующаяСтрока.УстанавливатьЗначение
					И ЗначениеЗаполнено(СуществующаяСтрока.ЗначениеРеквизита) Тогда
				СтрокаТаблицы.УстанавливатьЗначение = Истина;
				СтрокаТаблицы.ЗначениеРеквизита = СуществующаяСтрока.ЗначениеРеквизита;
			КонецЕсли;
			ВременнаяТаблица.Удалить(СуществующаяСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ВременнаяСтрока Из ВременнаяТаблица Цикл
		Если ВременнаяСтрока.УстанавливатьЗначение Тогда
			НоваяСтрока = ТаблицаОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВременнаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьНастройкиПоУмолчанию(Организация) Экспорт

	Поставляемые = ПрочитатьПредопределенныеДанные();
	Для Каждого Операция Из Поставляемые Цикл
		Для Каждого ЗагружаемаяОперация Из Операция.Значение Цикл
			Если ЗагружаемаяОперация.АльтернативныйВариант Тогда
				Продолжить;
			КонецЕсли;
			ТекущийЭлемент = ПолучитьЗаписанныйЭлементИлиСоздатьНовый(Организация, ЗагружаемаяОперация.ВидОперации);
			ЗаполнитьОперациюИзСвойствОперации(ТекущийЭлемент, ЗагружаемаяОперация);
			ТекущийЭлемент.Наименование = Строка(ТекущийЭлемент.ВидОперации);
			ТекущийЭлемент.Записать();
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли
